Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/3.0.2/samv71/atdf/ATSAMV71Q19.atdf
        <module name="RSWDT" id="11110" version="E">
          <instance name="RSWDT">
            <register-group address-space="base" name="RSWDT" name-in-module="RSWDT" offset="0x400E1900"/>
            <parameters>
              <param name="INSTANCE_ID" value="63"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="6056" version="Y">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1860"/>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="RTT" id="6081" version="M">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1830"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SDRAMC" id="6100" version="S">
          <instance name="SDRAMC">
            <register-group address-space="base" name="SDRAMC" name-in-module="SDRAMC" offset="0x40084000"/>
            <signals>
              <signal pad="PC18" function="A" index="0" group="A"/>
              <signal pad="PC18" function="A" index="0" group="NBS"/>
              <signal pad="PC19" function="A" index="1" group="A"/>
              <signal pad="PC20" function="A" index="2" group="A"/>
              <signal pad="PC21" function="A" index="3" group="A"/>
              <signal pad="PC22" function="A" index="4" group="A"/>
              <signal pad="PC23" function="A" index="5" group="A"/>
              <signal pad="PC24" function="A" index="6" group="A"/>
              <signal pad="PC25" function="A" index="7" group="A"/>
              <signal pad="PC26" function="A" index="8" group="A"/>
              <signal pad="PC27" function="A" index="9" group="A"/>
              <signal pad="PC28" function="A" index="10" group="A"/>
              <signal pad="PC29" function="A" index="11" group="A"/>
              <signal pad="PC30" function="A" index="12" group="A"/>
              <signal pad="PC31" function="A" index="13" group="A"/>
              <signal pad="PA18" function="C" index="14" group="A"/>
              <signal pad="PA19" function="C" index="15" group="A"/>
              <signal pad="PA20" function="C" index="16" group="A"/>
              <signal pad="PA20" function="C" index="0" group="BA"/>
              <signal pad="PA0" function="C" index="17" group="A"/>
              <signal pad="PA0" function="C" index="1" group="BA"/>
              <signal pad="PA1" function="C" index="18" group="A"/>
              <signal pad="PA23" function="C" index="19" group="A"/>
              <signal pad="PA24" function="C" index="20" group="A"/>
              <signal pad="PC16" function="A" index="21" group="A"/>
              <signal pad="PC16" function="A" group="NANDALE"/>
              <signal pad="PC17" function="A" index="22" group="A"/>
              <signal pad="PC17" function="A" group="NANDCLE"/>
              <signal pad="PA25" function="C" index="23" group="A"/>
              <signal pad="PD17" function="C" group="CAS"/>
              <signal pad="PC0" function="A" index="0" group="D"/>
              <signal pad="PC1" function="A" index="1" group="D"/>
              <signal pad="PC2" function="A" index="2" group="D"/>
              <signal pad="PC3" function="A" index="3" group="D"/>
              <signal pad="PC4" function="A" index="4" group="D"/>
              <signal pad="PC5" function="A" index="5" group="D"/>
              <signal pad="PC6" function="A" index="6" group="D"/>
              <signal pad="PC7" function="A" index="7" group="D"/>
              <signal pad="PE0" function="A" index="8" group="D"/>
              <signal pad="PE1" function="A" index="9" group="D"/>
              <signal pad="PE2" function="A" index="10" group="D"/>
              <signal pad="PE3" function="A" index="11" group="D"/>
              <signal pad="PE4" function="A" index="12" group="D"/>
              <signal pad="PE5" function="A" index="13" group="D"/>
              <signal pad="PA15" function="A" index="14" group="D"/>
              <signal pad="PA16" function="A" index="15" group="D"/>
              <signal pad="PC9" function="A" group="NANDOE"/>
              <signal pad="PC10" function="A" group="NANDWE"/>
              <signal pad="PC14" function="A" index="0" group="NCS"/>
              <signal pad="PC15" function="A" index="1" group="NCS"/>
              <signal pad="PC15" function="A" group="SDCS"/>
              <signal pad="PD18" function="A" index="1" group="NCS"/>
              <signal pad="PD18" function="A" group="SDCS"/>
              <signal pad="PA22" function="C" index="2" group="NCS"/>
              <signal pad="PC12" function="A" index="3" group="NCS"/>
              <signal pad="PD19" function="A" index="3" group="NCS"/>
              <signal pad="PC11" function="A" group="NRD"/>
              <signal pad="PC13" function="A" group="NWAIT"/>
              <signal pad="PC8" function="A" index="0" group="NWR"/>
              <signal pad="PC8" function="A" group="NWE"/>
              <signal pad="PD15" function="C" index="1" group="NWR"/>
              <signal pad="PD15" function="C" index="1" group="NBS"/>
              <signal pad="PD16" function="C" group="RAS"/>
              <signal pad="PC13" function="C" index="10" group="SDA"/>
              <signal pad="PD13" function="C" index="10" group="SDA"/>
              <signal pad="PD23" function="C" group="SDCK"/>
              <signal pad="PD14" function="C" group="SDCKE"/>
              <signal pad="PD29" function="C" group="SDWE"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="62"/>
            </parameters>
          </instance>
        </module>
        <module name="SMC" id="6498" version="J">
          <instance name="SMC">
            <register-group address-space="base" name="SMC" name-in-module="SMC" offset="0x40080000"/>
            <signals>
              <signal pad="PC18" function="A" index="0" group="A"/>
              <signal pad="PC18" function="A" index="0" group="NBS"/>
              <signal pad="PC19" function="A" index="1" group="A"/>
              <signal pad="PC20" function="A" index="2" group="A"/>
              <signal pad="PC21" function="A" index="3" group="A"/>
              <signal pad="PC22" function="A" index="4" group="A"/>
              <signal pad="PC23" function="A" index="5" group="A"/>
              <signal pad="PC24" function="A" index="6" group="A"/>
              <signal pad="PC25" function="A" index="7" group="A"/>
              <signal pad="PC26" function="A" index="8" group="A"/>
              <signal pad="PC27" function="A" index="9" group="A"/>
              <signal pad="PC28" function="A" index="10" group="A"/>
              <signal pad="PC29" function="A" index="11" group="A"/>
              <signal pad="PC30" function="A" index="12" group="A"/>
              <signal pad="PC31" function="A" index="13" group="A"/>
              <signal pad="PA18" function="C" index="14" group="A"/>
              <signal pad="PA19" function="C" index="15" group="A"/>
              <signal pad="PA20" function="C" index="16" group="A"/>
              <signal pad="PA20" function="C" index="0" group="BA"/>
              <signal pad="PA0" function="C" index="17" group="A"/>
              <signal pad="PA0" function="C" index="1" group="BA"/>
              <signal pad="PA1" function="C" index="18" group="A"/>
              <signal pad="PA23" function="C" index="19" group="A"/>
              <signal pad="PA24" function="C" index="20" group="A"/>
              <signal pad="PC16" function="A" index="21" group="A"/>
              <signal pad="PC16" function="A" group="NANDALE"/>
              <signal pad="PC17" function="A" index="22" group="A"/>
              <signal pad="PC17" function="A" group="NANDCLE"/>
              <signal pad="PA25" function="C" index="23" group="A"/>
              <signal pad="PD17" function="C" group="CAS"/>
              <signal pad="PC0" function="A" index="0" group="D"/>
              <signal pad="PC1" function="A" index="1" group="D"/>
              <signal pad="PC2" function="A" index="2" group="D"/>
              <signal pad="PC3" function="A" index="3" group="D"/>
              <signal pad="PC4" function="A" index="4" group="D"/>
              <signal pad="PC5" function="A" index="5" group="D"/>
              <signal pad="PC6" function="A" index="6" group="D"/>
              <signal pad="PC7" function="A" index="7" group="D"/>
              <signal pad="PE0" function="A" index="8" group="D"/>
              <signal pad="PE1" function="A" index="9" group="D"/>
              <signal pad="PE2" function="A" index="10" group="D"/>
              <signal pad="PE3" function="A" index="11" group="D"/>
              <signal pad="PE4" function="A" index="12" group="D"/>
              <signal pad="PE5" function="A" index="13" group="D"/>
              <signal pad="PA15" function="A" index="14" group="D"/>
              <signal pad="PA16" function="A" index="15" group="D"/>
              <signal pad="PC9" function="A" group="NANDOE"/>
              <signal pad="PC10" function="A" group="NANDWE"/>
              <signal pad="PC14" function="A" index="0" group="NCS"/>
              <signal pad="PC15" function="A" index="1" group="NCS"/>
              <signal pad="PC15" function="A" group="SDCS"/>
              <signal pad="PD18" function="A" index="1" group="NCS"/>
              <signal pad="PD18" function="A" group="SDCS"/>
              <signal pad="PA22" function="C" index="2" group="NCS"/>
              <signal pad="PC12" function="A" index="3" group="NCS"/>
              <signal pad="PD19" function="A" index="3" group="NCS"/>
              <signal pad="PC11" function="A" group="NRD"/>
              <signal pad="PC13" function="A" group="NWAIT"/>
              <signal pad="PC8" function="A" index="0" group="NWR"/>
              <signal pad="PC8" function="A" group="NWE"/>
              <signal pad="PD15" function="C" index="1" group="NWR"/>
              <signal pad="PD15" function="C" index="1" group="NBS"/>
              <signal pad="PD16" function="C" group="RAS"/>
              <signal pad="PC13" function="C" index="10" group="SDA"/>
              <signal pad="PD13" function="C" index="10" group="SDA"/>
              <signal pad="PD23" function="C" group="SDCK"/>
              <signal pad="PD14" function="C" group="SDCKE"/>
              <signal pad="PD29" function="C" group="SDWE"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="9"/>
            </parameters>
          </instance>
        </module>
        <module name="SPI" id="6088" version="ZK">
          <instance name="SPI0">
            <register-group address-space="base" name="SPI0" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PD20" function="B" group="MISO"/>
              <signal pad="PD21" function="B" group="MOSI"/>
              <signal pad="PB2" function="D" group="NPCS" index="0"/>
              <signal pad="PA31" function="A" group="NPCS" index="1"/>
              <signal pad="PD25" function="B" group="NPCS" index="1"/>
              <signal pad="PD12" function="C" group="NPCS" index="2"/>
              <signal pad="PD27" function="B" group="NPCS" index="3"/>
              <signal pad="PD22" function="B" group="SPCK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="2"/>
              <param name="DMAC_ID_TX" value="1"/>
              <param name="INSTANCE_ID" value="21"/>
            </parameters>
          </instance>
          <instance name="SPI1">
            <register-group address-space="base" name="SPI1" name-in-module="SPI" offset="0x40058000"/>
            <signals>
              <signal pad="PC26" function="C" group="MISO"/>
              <signal pad="PC27" function="C" group="MOSI"/>
              <signal pad="PC25" function="C" group="NPCS" index="0"/>
              <signal pad="PC28" function="C" group="NPCS" index="1"/>
              <signal pad="PD0" function="C" group="NPCS" index="1"/>
              <signal pad="PC29" function="C" group="NPCS" index="2"/>
              <signal pad="PD1" function="C" group="NPCS" index="2"/>
              <signal pad="PC30" function="C" group="NPCS" index="3"/>
              <signal pad="PD2" function="C" group="NPCS" index="3"/>
              <signal pad="PC24" function="C" group="SPCK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="4"/>
              <param name="DMAC_ID_TX" value="3"/>
              <param name="INSTANCE_ID" value="42"/>
            </parameters>
          </instance>
        </module>
        <module name="SSC" id="6078" version="O">
          <instance name="SSC">
            <register-group address-space="base" name="SSC" name-in-module="SSC" offset="0x40004000"/>
            <signals>
              <signal pad="PA10" function="C" group="RD"/>
              <signal pad="PD24" function="B" group="RF"/>
              <signal pad="PA22" function="A" group="RK"/>
              <signal pad="PB5" function="D" group="TD"/>
              <signal pad="PD10" function="C" group="TD"/>
              <signal pad="PD26" function="B" group="TD"/>
              <signal pad="PB0" function="D" group="TF"/>
              <signal pad="PB1" function="D" group="TK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="33"/>
              <param name="DMAC_ID_TX" value="32"/>
              <param name="INSTANCE_ID" value="22"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="6452" version="ZB">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1810"/>
            <parameters>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
        </module>
