Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/3.0.2/samv71/atdf/ATSAMV71Q19.atdf
        <register caption="DMA Channel Status Register" name="ISI_DMA_CHSR" offset="0x40" rw="R" size="4">
          <bitfield caption="Preview DMA Channel Status" mask="0x00000001" name="P_CH_S"/>
          <bitfield caption="Code DMA Channel Status" mask="0x00000002" name="C_CH_S"/>
        </register>
        <register caption="DMA Preview Base Address Register" name="ISI_DMA_P_ADDR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Preview Image Base Address" mask="0xFFFFFFFC" name="P_ADDR"/>
        </register>
        <register caption="DMA Preview Control Register" name="ISI_DMA_P_CTRL" offset="0x48" rw="RW" size="4">
          <bitfield caption="Descriptor Fetch Control Bit" mask="0x00000001" name="P_FETCH"/>
          <bitfield caption="Descriptor Writeback Control Bit" mask="0x00000002" name="P_WB"/>
          <bitfield caption="Transfer Done Flag Control" mask="0x00000004" name="P_IEN"/>
          <bitfield caption="Preview Transfer Done" mask="0x00000008" name="P_DONE"/>
        </register>
        <register caption="DMA Preview Descriptor Address Register" name="ISI_DMA_P_DSCR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Preview Descriptor Base Address" mask="0xFFFFFFFC" name="P_DSCR"/>
        </register>
        <register caption="DMA Codec Base Address Register" name="ISI_DMA_C_ADDR" offset="0x50" rw="RW" size="4">
          <bitfield caption="Codec Image Base Address" mask="0xFFFFFFFC" name="C_ADDR"/>
        </register>
        <register caption="DMA Codec Control Register" name="ISI_DMA_C_CTRL" offset="0x54" rw="RW" size="4">
          <bitfield caption="Descriptor Fetch Control Bit" mask="0x00000001" name="C_FETCH"/>
          <bitfield caption="Descriptor Writeback Control Bit" mask="0x00000002" name="C_WB"/>
          <bitfield caption="Transfer Done Flag Control" mask="0x00000004" name="C_IEN"/>
          <bitfield caption="Codec Transfer Done" mask="0x00000008" name="C_DONE"/>
        </register>
        <register caption="DMA Codec Descriptor Address Register" name="ISI_DMA_C_DSCR" offset="0x58" rw="RW" size="4">
          <bitfield caption="Codec Descriptor Base Address" mask="0xFFFFFFFC" name="C_DSCR"/>
        </register>
        <register caption="Write Protection Mode Register" name="ISI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key Password" mask="0xFFFFFF00" name="WPKEY" values="ISI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ISI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Version Register" name="ISI_VERSION" offset="0xFC" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
      <value-group caption="" name="ISI_CFG1__THMASK">
        <value caption="Only 4 beats AHB burst allowed" name="BEATS_4" value="0x0"/>
        <value caption="Only 4 and 8 beats AHB burst allowed" name="BEATS_8" value="0x1"/>
        <value caption="4, 8 and 16 beats AHB burst allowed" name="BEATS_16" value="0x2"/>
      </value-group>
      <value-group caption="" name="ISI_CFG2__YCC_SWAP">
        <value caption="Byte 0 Cb(i)Byte 1 Y(i)Byte 2 Cr(i)Byte 3 Y(i+1)" name="DEFAULT" value="0x0"/>
        <value caption="Byte 0 Cr(i)Byte 1 Y(i)Byte 2 Cb(i)Byte 3 Y(i+1)" name="MODE1" value="0x1"/>
        <value caption="Byte 0 Y(i)Byte 1 Cb(i)Byte 2 Y(i+1)Byte 3 Cr(i)" name="MODE2" value="0x2"/>
        <value caption="Byte 0 Y(i)Byte 1 Cr(i)Byte 2 Y(i+1)Byte 3 Cb(i)" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="" name="ISI_CFG2__RGB_CFG">
        <value caption="Byte 0 R/G(MSB)Byte 1 G(LSB)/BByte 2 R/G(MSB)Byte 3 G(LSB)/B" name="DEFAULT" value="0x0"/>
        <value caption="Byte 0 B/G(MSB)Byte 1 G(LSB)/RByte 2 B/G(MSB)Byte 3 G(LSB)/R" name="MODE1" value="0x1"/>
        <value caption="Byte 0 G(LSB)/RByte 1 B/G(MSB)Byte 2 G(LSB)/RByte 3 B/G(MSB)" name="MODE2" value="0x2"/>
        <value caption="Byte 0 G(LSB)/BByte 1 R/G(MSB)Byte 2 G(LSB)/BByte 3 R/G(MSB)" name="MODE3" value="0x3"/>
      </value-group>
      <value-group caption="" name="ISI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x495349"/>
      </value-group>
    </module>
    <module name="MATRIX" caption="AHB Bus Matrix" id="11282" version="H">
      <register-group name="MATRIX_PR" size="8">
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS" offset="0x00" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
        </register>
        <register caption="Priority Register B for Slave 0" name="MATRIX_PRBS" offset="0x04" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
        </register>
      </register-group>
      <register-group name="MATRIX">
        <register caption="Master Configuration Register 0" name="MATRIX_MCFG" offset="0x0" rw="RW" size="4" count="12">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG__ULBT"/>
        </register>
