Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/3.0.2/samv71/atdf/ATSAMV71Q19.atdf
    <module name="MLB" caption="MediaLB" id="11287" version="C">
      <register-group name="MLB">
        <register caption="MediaLB Control 0 Register" name="MLB_MLBC0" offset="0x000" rw="RW" size="4">
          <bitfield caption="MediaLB Enable" mask="0x00000001" name="MLBEN"/>
          <bitfield caption="MLBCLK (MediaLB clock) speed select" mask="0x0000001C" name="MLBCLK" values="MLB_MLBC0__MLBCLK"/>
          <bitfield caption="Must be Written to 0" mask="0x00000020" name="ZERO"/>
          <bitfield caption="MediaLB Lock Status (read-only)" mask="0x00000080" name="MLBLK"/>
          <bitfield caption="Asynchronous Tx Packet Retry" mask="0x00001000" name="ASYRETRY"/>
          <bitfield caption="Control Tx Packet Retry" mask="0x00004000" name="CTLRETRY"/>
          <bitfield caption="The number of frames per sub-buffer for synchronous channels" mask="0x00038000" name="FCNT" values="MLB_MLBC0__FCNT"/>
        </register>
        <register caption="MediaLB Channel Status 0 Register" name="MLB_MS0" offset="0x00C" rw="RW" size="4">
          <bitfield caption="MediaLB Channel Status [31:0] (cleared by writing a 0)" mask="0xFFFFFFFF" name="MCS"/>
        </register>
        <register caption="MediaLB Channel Status1 Register" name="MLB_MS1" offset="0x014" rw="RW" size="4">
          <bitfield caption="MediaLB Channel Status [63:32] (cleared by writing a 0)" mask="0xFFFFFFFF" name="MCS"/>
        </register>
        <register caption="MediaLB System Status Register" name="MLB_MSS" offset="0x020" rw="RW" size="4">
          <bitfield caption="Reset System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000001" name="RSTSYSCMD"/>
          <bitfield caption="Network Lock System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000002" name="LKSYSCMD"/>
          <bitfield caption="Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000004" name="ULKSYSCMD"/>
          <bitfield caption="Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000008" name="CSSYSCMD"/>
          <bitfield caption="Software System Command Detected in the System Quadlet (cleared by writing a 0)" mask="0x00000010" name="SWSYSCMD"/>
          <bitfield caption="Service Request Enabled" mask="0x00000020" name="SERVREQ"/>
        </register>
        <register caption="MediaLB System Data Register" name="MLB_MSD" offset="0x024" rw="R" size="4">
          <bitfield caption="System Data (Byte 0)" mask="0x000000FF" name="SD0"/>
          <bitfield caption="System Data (Byte 1)" mask="0x0000FF00" name="SD1"/>
          <bitfield caption="System Data (Byte 2)" mask="0x00FF0000" name="SD2"/>
          <bitfield caption="System Data (Byte 3)" mask="0xFF000000" name="SD3"/>
        </register>
        <register caption="MediaLB Interrupt Enable Register" name="MLB_MIEN" offset="0x02C" rw="RW" size="4">
          <bitfield caption="Isochronous Rx Protocol Error Enable" mask="0x00000001" name="ISOC_PE"/>
          <bitfield caption="Isochronous Rx Buffer Overflow Enable" mask="0x00000002" name="ISOC_BUFO"/>
          <bitfield caption="Synchronous Protocol Error Enable" mask="0x00010000" name="SYNC_PE"/>
          <bitfield caption="Asynchronous Rx Done Enable" mask="0x00020000" name="ARX_DONE"/>
          <bitfield caption="Asynchronous Rx Protocol Error Enable" mask="0x00040000" name="ARX_PE"/>
          <bitfield caption="Asynchronous Rx Break Enable" mask="0x00080000" name="ARX_BREAK"/>
          <bitfield caption="Asynchronous Tx Packet Done Enable" mask="0x00100000" name="ATX_DONE"/>
          <bitfield caption="Asynchronous Tx Protocol Error Enable" mask="0x00200000" name="ATX_PE"/>
          <bitfield caption="Asynchronous Tx Break Enable" mask="0x00400000" name="ATX_BREAK"/>
          <bitfield caption="Control Rx Packet Done Enable" mask="0x01000000" name="CRX_DONE"/>
          <bitfield caption="Control Rx Protocol Error Enable" mask="0x02000000" name="CRX_PE"/>
          <bitfield caption="Control Rx Break Enable" mask="0x04000000" name="CRX_BREAK"/>
          <bitfield caption="Control Tx Packet Done Enable" mask="0x08000000" name="CTX_DONE"/>
          <bitfield caption="Control Tx Protocol Error Enable" mask="0x10000000" name="CTX_PE"/>
          <bitfield caption="Control Tx Break Enable" mask="0x20000000" name="CTX_BREAK"/>
        </register>
        <register caption="MediaLB Control 1 Register" name="MLB_MLBC1" offset="0x03C" rw="RW" size="4">
          <bitfield caption="MediaLB Lock Error Status (cleared by writing a 0)" mask="0x00000040" name="LOCK"/>
          <bitfield caption="MediaLB Clock Missing Status (cleared by writing a 0)" mask="0x00000080" name="CLKM"/>
          <bitfield caption="Node Device Address" mask="0x0000FF00" name="NDA"/>
        </register>
        <register caption="HBI Control Register" name="MLB_HCTL" offset="0x080" rw="RW" size="4">
          <bitfield caption="Address Generation Unit 0 Software Reset" mask="0x00000001" name="RST0"/>
          <bitfield caption="Address Generation Unit 1 Software Reset" mask="0x00000002" name="RST1"/>
          <bitfield caption="HBI Enable" mask="0x00008000" name="EN"/>
        </register>
        <register caption="HBI Channel Mask 0 Register 0" name="MLB_HCMR" offset="0x88" rw="RW" size="4" count="2">
          <bitfield caption="Bitwise Channel Mask Bit [31:0]" mask="0xFFFFFFFF" name="CHM"/>
        </register>
        <register caption="HBI Channel Error 0 Register 0" name="MLB_HCER" offset="0x90" rw="R" size="4" count="2">
          <bitfield caption="Bitwise Channel Error Bit [31:0]" mask="0xFFFFFFFF" name="CERR"/>
        </register>
        <register caption="HBI Channel Busy 0 Register 0" name="MLB_HCBR" offset="0x98" rw="R" size="4" count="2">
          <bitfield caption="Bitwise Channel Busy Bit [31:0]" mask="0xFFFFFFFF" name="CHB"/>
        </register>
        <register caption="MIF Data 0 Register 0" name="MLB_MDAT" offset="0xC0" rw="RW" size="4" count="4">
          <bitfield caption="CRT or DBR Data" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="MIF Data Write Enable 0 Register 0" name="MLB_MDWE" offset="0xD0" rw="RW" size="4" count="4">
          <bitfield caption="Bitwise write enable for CTR data - bits[31:0]" mask="0xFFFFFFFF" name="MASK"/>
        </register>
        <register caption="MIF Control Register" name="MLB_MCTL" offset="0x0E0" rw="RW" size="4">
          <bitfield caption="Transfer Complete (Write 0 to Clear)" mask="0x00000001" name="XCMP"/>
        </register>
